Ran Plan for dir: `resources` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform Landscape: a parsing error occured. Falling back to original Terraform output...
[0m[1mRefreshing Terraform state in-memory prior to plan...[0m
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
[0m
[0m[1mdata.aws_iam_policy_document.default_ec2_assume_role: Refreshing state...[0m
[0m[1mdata.aws_iam_policy_document.atlantis-s3-read: Refreshing state...[0m

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_iam_policy.test_policy[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_policy" "test_policy" {
      [32m+[0m [0m[1m[0marn[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m = "test policy for atlantis"
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "atlantis-policy"
      [32m+[0m [0m[1m[0mpath[0m[0m        = "/"
      [32m+[0m [0m[1m[0mpolicy[0m[0m      = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"s3:PutObject",
                          [32m+[0m [0m"s3:ListBucket",
                          [32m+[0m [0m"s3:GetObject",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = [
                          [32m+[0m [0m"arn:aws:s3:::test9/*",
                          [32m+[0m [0m"arn:aws:s3:::test9",
                          [32m+[0m [0m"arn:aws:s3:::test8/*",
                          [32m+[0m [0m"arn:aws:s3:::test8",
                          [32m+[0m [0m"arn:aws:s3:::test7/*",
                          [32m+[0m [0m"arn:aws:s3:::test7",
                          [32m+[0m [0m"arn:aws:s3:::test6/*",
                          [32m+[0m [0m"arn:aws:s3:::test6",
                          [32m+[0m [0m"arn:aws:s3:::test5/*",
                          [32m+[0m [0m"arn:aws:s3:::test5",
                          [32m+[0m [0m"arn:aws:s3:::test4/*",
                          [32m+[0m [0m"arn:aws:s3:::test4",
                          [32m+[0m [0m"arn:aws:s3:::test3/*",
                          [32m+[0m [0m"arn:aws:s3:::test3",
                          [32m+[0m [0m"arn:aws:s3:::test20/*",
                          [32m+[0m [0m"arn:aws:s3:::test20",
                          [32m+[0m [0m"arn:aws:s3:::test2/*",
                          [32m+[0m [0m"arn:aws:s3:::test2",
                          [32m+[0m [0m"arn:aws:s3:::test19/*",
                          [32m+[0m [0m"arn:aws:s3:::test19",
                          [32m+[0m [0m"arn:aws:s3:::test18/*",
                          [32m+[0m [0m"arn:aws:s3:::test18",
                          [32m+[0m [0m"arn:aws:s3:::test17/*",
                          [32m+[0m [0m"arn:aws:s3:::test17",
                          [32m+[0m [0m"arn:aws:s3:::test16/*",
                          [32m+[0m [0m"arn:aws:s3:::test16",
                          [32m+[0m [0m"arn:aws:s3:::test1/*",
                          [32m+[0m [0m"arn:aws:s3:::test1",
                        ]
                      [32m+[0m [0mSid      = "1"
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
    }

[1m  # aws_iam_role.test_atlantis[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role" "test_atlantis" {
      [32m+[0m [0m[1m[0marn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0massume_role_policy[0m[0m    = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "sts:AssumeRole"
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mService = "ec2.amazonaws.com"
                        }
                      [32m+[0m [0mSid       = ""
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mcreate_date[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mforce_detach_policies[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mmax_session_duration[0m[0m  = 3600
      [32m+[0m [0m[1m[0mname[0m[0m                  = "atlantis-role"
      [32m+[0m [0m[1m[0mpath[0m[0m                  = "/"
      [32m+[0m [0m[1m[0munique_id[0m[0m             = (known after apply)
    }

[1m  # aws_iam_role_policy_attachment.atlantis_policy_role_attachment[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "atlantis_policy_role_attachment" {
      [32m+[0m [0m[1m[0mid[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpolicy_arn[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m       = "atlantis-role"
    }

[1m  # null_resource.test_resource[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "null_resource" "test_resource" {
      [32m+[0m [0m[1m[0mid[0m[0m = (known after apply)
    }

[0m[1mPlan:[0m 4 to add, 0 to change, 0 to destroy.[0m

------------------------------------------------------------------------

This plan was saved to: /Users/apurv/.atlantis/repos/Apurv11/test_atlantis/5/default/resources/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/Users/apurv/.atlantis/repos/Apurv11/test_atlantis/5/default/resources/default.tfplan"


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d resources`
* :put_litter_in_its_place: To **delete** this plan click [here](https://b75e-2405-201-ac01-c214-3d5f-24a8-2153-e522.in.ngrok.io/lock?id=Apurv11%252Ftest_atlantis%252Fresources%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d resources`
</details>


---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
